"""
1. Залогиниться в Github в браузере
2. Создать нужный репозиторий
3. В Pycharm зайти File - Settings - Github - нажать "+"
4. Log via Github (связали Github c PyCharm)
5. В созданном репозитории копируем путь к нему
6. Заходим в ленточном меню Git - Manage Remotes,
нажать "+" и вставить путь
"""

prompt = """Витязь на распутье
Налево (L) пойдёшь, вольну-волю обретёшь...
Направо (R) пойдёшь, коня потеряешь...
Прямо пойдёшь (F), сыт и весел будешь..."""
print(prompt)
choice = input('Куда идём (L, R или F): ')
if choice == 'L' or choice == 'l':
    print('Вольная воля')
elif choice == 'R':
    print('Конь сбежал')
elif choice == 'F':
    print('Сыт и весел')
else:
    print('Выбор не понятен')
